{
	"text" : "Write me a job resume . It needs to begin with an proffossional summary, which includes a title.The title should market myself for the job I am applying to. This should have 2 to 5 discripters  such as detail-oriented or self motivated. The rest shuld hate a few sentences which highlights my knowledge tech skills and expertise relevent to the job announcment. The job announcment ask for the folowing: \\\"Reporting to the Director, Productivity Engineering Tools (PET), you will work with a team of developer engineers to manage and develop our offerings and enable others to use them successfully.\r\n\r\nMonitor the health of PET systems, tools, and services, participating in an on-call rotation to address issues that arise.\r\nProcess updates and changes to PET tools and services as needed.\r\nDevelop and maintain integrations and customizations for PET tools and services as needed.\r\nShare knowledge on how to use PET tools, systems, and services through demos, trainings, or 1-on-1 meetings.\r\n\r\nWhat Does Ciena Expect of You?\r\n\r\nInitiative - you're a self-starter who works with limited direction and is committed to delivering against deadlines.\r\nA customer first mentality - what's important to the customer is also important to you.\r\nAgility - you are readily able to manage competing and ever-changing priorities and maintain a balanced and methodical approach to problem solving.\r\nCraftsmanship - You believe that engineers deserve to work with great tools, and that good coding is good craftsmanship.\r\nThe flexibility to work independently and as part of a broader team - you thrive in a team environment, are comfortable working independently, and know how to get things done in a virtual environment.\r\nRelationship builder - with a proven ability to influence, you're able to quickly develop trusted connections and get work done through others.\r\n\r\nThe Must Haves\r\n\r\n0-1 year of experience in software development and a propensity for quick learning.\r\nProficiency in at least one programming language (Python preferred) and comfort learning a new one quickly if needed.\r\nFamiliarity with REST APIs and how to use the programming languages you are comfortable with to interact with them.\r\nExperience with version control systems like Git, and version control practices.\r\nFamiliarity with a unit testing framework in the language you are comfortable with.\r\nDemonstrated strong interpersonal and communication skills.\r\nAnalytical thinking with a growth mindset.\r\n \\\" use the following information to write the resume : \\\"Jeff Calderon Marysville, Washington, United States jeff.d.calderon@gmail.com linkedin.com\/in\/jeffdcalderon Summary Research Physicist - 3 years: Preformed study of personal radiation detection units for border\/law enforcement;presented results from computer models and statistical analysis to validate radiation transport software—directlyresulted in Domestic Nuclear Detection Office awarding 500K for continued analysis.  Officer (NOAA) - Technical problem solver; developed Python tools for efficient hydrographic. Efficient manager;organized meteorological work flow for scientific computing system aboard the NOAA Ship Fairweather 6 years Aerospace Equipment Mechanic (USAF); Analytical ability; quickly interpret schematics, diagrams, technical documents and deliver clear and precise information in spoken and written form. 8 years Excellent communicator: prepared\/presented readiness statistics to air base leadership, maintained a database ofaircraft maintenance actions supporting 50 F-16 fighters.  Fluent in modern computing practices; Python, Linux, OpenAI, AWS, C++, MATLAB, Docker, Visual Studio,Serverless Architecture (Lambda); Network Security, Microsoft Office, sonar acquisition hardware\/software, nativeSpanish speaker, 16+ years with secret security clearance.  Experience Commissioned Officer NOAA: National Oceanic & Atmospheric Administration Jan 2016 - May 2023 (7 years 5 months) NOAA Corps Officers are technically competent and assume positions of leadership and command inthe National Oceanic And Atmospheric Administration (NOAA) and Department of Commerce (DOC)programs and in the Armed Forces during times of war or national emergency.  Acquired hydrographic data in support of the Office of Coast Survey; utilized GIS software and Pythonbased automations to process bathymetric data into NOAA nautical charts.  Served as Ancillary Data Manager; configured the Science Computing System(SCS), connected\/configured sensor to SCS servers, configured network ports for NMEA based sensors.  Applied coding skills to an array of shipboard problems Spearheaded work flow initiatives implementing Smartsheet automations for travel system tracking, purchase requests, ship's project instruction drafting and tracking.  Research Physicist Praxis, Inc.  Jan 2014 - Jan 2016 (2 years 1 month) Jeff Calderon - page 1 Preformed study of personal radiation detection units for border\/law enforcement; presented resultsfrom computer models and statistical analysis to validate radiation transport software.  Supported simulations\/models to predict best active interrogation procedure and passive detectionWMD\/radiological device detection in support of the Defense Threat Reduction Agency.  Faculty Assistant Researcher University of Maryland Jan 2013 - Apr 2015 (2 years 4 months) Technical Sergeant, United States Air Force May 2002 - Jan 2010 (7 years 9 months) Aerospace Ground Equipment (AGE) Mechanic Performs scheduled and unscheduled maintenance on AGE. Inspects, tests, and operates AGE todetermine equipment serviceability and proper operation. Diagnoses mechanical and electronic circuitry malfunctions using visual and auditory senses, test equipment, and technical publications.  Removes, disassembles, repairs, cleans, treats for corrosion, assembles, and reinstalls AGEaccessories and components. Stencils and marks AGE. Services equipment with fuel, oil, coolant, water, hydraulic fluid, and air. Operates, cleans, inspects, and services AGE towing vehicles; maintains vehicle forms. Provides dispatch service for AGE, including positioning equipment to support aircraft maintenance and flying operation Education Everett Community College Cyber Security Analyst Certificate, Cyber Security 2023 - 2024 Digital Forensics SCADA ( supervisory control and data acquisition) Network Defense Ethical Hacking University of Maryland Bachelor of Science - BS, Professional Physics 2011 - 2015 High Energy Physics Computational Physics Everett Community College Associate of Arts and Sciences - AAS, Computer Science Jun 2023 - Jun 2024 C++ Python Linux Cloud Computing Jeff Calderon - page 2 AWS University of Maryland Global Campus Bachelor of Science - BS, Social Sciences 2005 - 2010 Community College of the Air Force Associate of Science - AS, Aerospace Ground Equipment Technology 2002 - 2005 University of Maryland Global Campus Associate of Arts - AA, Liberal Arts and Sciences\/Liberal Studies 2002 - 2005 Northwest Florida State College Associate of Arts and Sciences - AAS, Industrial Mechanics and MaintenanceTechnology Skills Network Security • Large Language Models (LLM) • Amazon Web Services (AWS) • Cloud Computing • AWS Lambda • AWS Command Line Interface (CLI) • Aws • GitHub • Microsoft Visual Studio Code • Vim Jeff Calderon - page 3 5\/29\/23, 7: 59 PM Print Resume https: \/\/www.usajobs.gov\/Applicant\/Document\/Resumes 1\/4 Jeffrey Calderon 6207 97th St NE Marysville, Washington 98270 United States Mobile: 9167128396 Email: jeff.d.calderon@gmail.com Work Experience:Commissioned Officer, Lieutenant National Oceanic and Atmospheric Administration Commissioned Officer Corps1305 East-West HwySilver Spring, MD1\/2017 - 5\/2023Salary: $100, 000.00 USD Per YearHours per week: 70Duties, Accomplishments and Related Skills:Acquired hydrographic data as Hydrographer-In-Charge (HIC), using multi-beam and side scan sonars in support of the Office of Coast Survey; utilized GIS software and Python based data processing tools to incorporate bathymetric data into NOAA nautical charts. Prepared descriptive reports based on bathymetric data. Utilized statistics, ArcGIS, Teledyne CARIS HIPS and SIPS and Pydro to ensure project compliance with International hydrographic Organization standards.Compared remote sensing data using statistical techniques to validate seafloor depth measurements technical analyses reported error values consistent with International Maritime Organization Standards.Served as Ancillary Data Manager; configured the Scientific Computing System(SCS), connected\/configured sensor to SCS servers, configured network ports for (National Marine Electronics Association) NMEA based sensors. Aggregated Ship board data from sensors for data analysis and system validation.Applied Python programing language skills to an array of shipboard problems; automated DVD library inventory tracking, implementation of Windows graphic user interface based mariner Sea Service reports.Spearheaded work flow initiatives implementing Smartsheet automations for travel system tracking, purchase request, ship's project instruction drafting and tracking.Supervisor: Commander Jesse Milton (6814430480)Okay to contact this Supervisor: Yes Research Physicist Naval Research Laboratory 4555 Overlook Ave S.W.  Washinton.  1\/2015 - 12\/2017 Hours per week: 40 Duties, Accomplishments and Related Skills: Preformed study of personal radiation detection units for border\/law enforcement; presented results from computer models and statistical analysis tovalidate software. Studies directly resulted in Domestic Nuclear Detection Office awarding 500K for continued analysis.  Designed graphic user interface for fast implementation of scenario based radiation simulation software running on Linux. Managed large multi-daylong computer models running Geant4 Toolkit derived studies on Crey high performance computing in the C++ programming language.  Reviewed, assessed, validated, debugged and assisted in development of SWORD (Software for the Optimization of Radiation Detection) source code-- led to government renewal and reinvestment of SWORD research and development.  Supported simulations\/models to predict best active interrogation procedure and passive detection Weapons of Mass Destruction (WMD)\/radiological device detection in support of the Defense Threat Reduction Agency.  Transformed radiation transportation model results from complex technical information to digestible slides, charts and synopsis for non-physicist.  Faculty Assistant University of Maryland High Energy Physics Group 4296 Stadium Dr College Park, MD 1\/2016 - 12\/2016 Hours per week: 25 Duties, Accomplishments and Related Skills: Designed software to analyze data and generate publication quality plots using C++\/ROOT\/Python\/Linux.  Co-authored publication using LaTex code based document preparation; reported findings of particle physics experiments conducted at the LargeHadron Collider-Super Proton Synchrotron Test Beam area -- Published by European Organization for Nuclear Research (CERN).  Developed simulations for hadron calorimetry, developed Monte-Carlo technique fitter program using C++ and ROOT—enabled efficiencyquantification of prototype scintillating tile.  Supervisor: Professor Sarah Eno (301-405-2365) Okay to contact this Supervisor: Yes Undergraduate Laboratory Researcher University of Maryland High Energy Physics Group 4296 Stadium Dr College Park, MD 1\/2015 - 12\/2015 Hours per week: 30 5\/29\/23, 7: 59 PM Print Resume https: \/\/www.usajobs.gov\/Applicant\/Document\/Resumes 3\/4 Duties, Accomplishments and Related Skills: Created computer simulations to refine detector prototype; lead to 80% improvement in prototype detector radiation hardening Configured hardware for analyzing light yields of experimental liquid scintillators using various data analytical methods. Wired NIM rack logic unitsPrepared, plotted, and presented data using Python, MATLAB,C++\/ROOT, Excel, and PowerPoint.  Aerospace Grounds Equipment Craftsman U.S. Air Force 3010 Defense Pentagon Washington DC, DC 1\/2002 - 1\/2010 Hours per week: 70 Duties, Accomplishments and Related Skills: [US citizenship, Registered for Selective Service ] Administered data base of 2.3 million dollars of equipment as Primary Equipment Account Custodian. Led and supervised teams of technicians indaily equipment inspections and maintenance operations. Ensured real-time air craft data availability to base commanders by updating status changesinto the Integrated Maintenance Data System and other computer based systems. Allocated resources by dispatching maintenance personal in supportof base-wide aerospace maintenance.  Prepared\/presented readiness statistics to Aviano Air Base 31st Fighter Wing leadership, maintained a database of aircraft maintenance actionssupporting 50 F-16 fighters jets as Weapon System Operator.  Education: University of Maryland College Park, MD United States Bachelor's degree 12 \/ 2015 GPA: 3.1 of a maximum 4.0 Credits Earned: Quarter Hours Major: Proffessional Physics Minor: Philosophy Relevant Coursework, Licenses and Certifications: Mechanics and Relativity (electrical fields and circuits) Modern Physics Classical Mechanics (statics, dynamics, fluid mechanics, hydraulics)Statistical Thermodynamics Electricity and Magnetism Fields Waves Statistics Differential and integral calculus University of Maryland University College Adelphi, MD United States Bachelor's degree 12 \/ 2011 Credits Earned: Semester Hours Major: Social Science Relevant Coursework, Licenses and Certifications: Statistics Community College of the Air Force Gunter AFB, AL United States Associate's degree 1 \/ 2008 Credits Earned: Semester Hours Major: Aerospace Ground Equipment Technology Relevant Coursework, Licenses and Certifications:\n Commissioned Officer, Lieutenant 2017 - 2023\r\nNational Oceanic and Atmospheric Administration\r\nCommissioned Officer Corps\r\nAcquired hydrographic data using remote sensing and automated\r\nsystems. Utilized GIS software and Python based data processing\r\ntools. Planned, led and executed hydrographic survey projects.\r\nMade quantitative analysis and systemic error estimations. Served\r\nas Ancillary Data Manager aboard NOAA vessels; configured the\r\nScience Computing System(SCS), connected\/configured sensor to\r\nSCS servers, configured network ports for (National Marine\r\nElectronics Association) NMEA based sensors. Spearheaded various\r\nwork flow initiatives implementing automations for travel system\r\ntracking, purchase request, ship's project plan drafting, and\r\nidentifying and implementing software solutions.\r\nResearch Physicist 2015 - 2017\r\nNaval Research Laboratory\r\nPreformed study of personal radiation detection units for border\/law\r\nenforcement; presented results from computer models and statistical\r\nanalysis to validate software. Designed graphic user interface for\r\nfast implementation of scenario based radiation simulation software\r\nrunning on Linux. Reviewed, assessed, validated, debugged and\r\nassisted in development of SWORD (Software for the Optimization\r\nof Radiation Detection) source code. Supported simulations\/models\r\nto predict best active interrogation procedure and passive detection.\r\nFaculty Assistant 2015 - 2016\r\nUniversity of Maryland High Energy Physics Group\r\nDesigned software to analyze data and generate publication quality\r\nplots using C++\/ROOT\/Python\/Linux.Co-authored publication\r\nusing LaTex code based document preparation; reported findings of\r\nparticle physics experiments conducted at the LargeHadron\r\nCollider-Super Proton Synchrotron Test Beam area -- Published by\r\nEuropean Organization for Nuclear Research (CERN).\r\nAerospace Grounds Equipment Craftsman 2002 - 2010\r\nU.S. Air Force\r\nAdministered data base of 2.3 million dollars of equipment. Led\r\nand supervised teams of technicians in maintenance operations.\r\nEnsured real-time air craft data availability to base commanders by\r\nupdating computer based systems. Maintained a database of aircraft\r\nmaintenance actions supporting 50 F-16 fighters jets. Summary:\r\nA team building, problem\r\nsolver. Innovation and\r\nlearning . Dedicated and\r\ndetail oriented. A skilled\r\nCommunicator ready to lead\r\nWork Experience\r\n\/jeffdcalderon github.com\/aggressor-FZX\r\nSkills\r\nPython, C++, JavaScript, Git,\r\nLinux, Windows, PyQT, Gimp\r\nToolkit, APIs, Matplotlib,\r\nPandas, AWS, Visual Studio,\r\nServerless, Network Security.SUMMARY\r\n•Understands Marine Operations software needs; developed stand-alone Python for Windows applications, automated time consuming tasks•Experienced technical communicator: organized\/prepared\/presented readiness statistics to decision makers, supporting 50 Aircraft (Air Force), 13 oceanographic research vessels (NOAA)•Years of experience as a bridge officer, Hydrographer-in-Charge and conducted fishing aboard NOAA Vessels.•Technical problem solver; developed simulations for radiation detection software; developed Monte-Carlo technique solver using C++ and ROOT,Developed Python Based GUI for NOAA Vessels\r\n2015\r\n2011\r\nEDUCATION Bachelor of Science in Physics University of Maryland, College Park MD Bachelor of Science in Social Science University of Maryland University College, Adelphi MD Associate of Applied Science in Industrial Management TechnologyNorthwest Florida State College, Niceville FL 2017 To Present\r\n2015 TO 2017\r\nSKILLS Python, ROOT, Linux, MATLAB, Excel, JavaScript, physics, Smartsheet, Google Apps Script, Secret clearance, Ship-board systems, weather sensor, NMEA, navigation systems, GIS, personnel database administration, Spanish.\r\n•Preformed study of personal radiation detection units for border\/law enforcement; presented results fromcomputer models and statistical analysis to validate software—directly resulted in Domestic NuclearDetection Office awarding 500K for continued analysis.•Designed graphic user interface for fast implementation of scenario based radiation simulation softwarerunning on Linux.•Implemented enhancements, debugged and assisted in development of SWORD (Software for theOptimization of Radiation Detection) source code—led to Gov’t renewal & reinvestment of SWORD researchand development.\r\n2012 TO 2015\r\nUndergraduate Laboratory Researcher University of Maryland High Energy Physics Group, College Park MD\r\n•Created computer simulations to refine detector prototype; lead to 80% improvement in radiation hardening.•Configured hardware for analyzing light yields of experimental liquid scintillators. Wired NIM rack logic units.Prepared, plotted, and presented data using Python, C++\/ROOT, Excell, and PowerPoint.\r\nFaculty Assistant\r\nUniversity of Maryland High Energy Physics Group, College Park MD \/ CERN Genève Switzerland\r\n2016\r\n• Designed software to analyze data and generate publication quality plots using C++\/ROOT\/Python\/Linux\r\n• Coauthored publication using LaTex; reported findings of particle physics experiments conducted at the Large\r\nHadron Collider-super proton synchrotron test beam area—Published by CERN.\r\nResearch Physicist\r\nNaval Research Laboratory\r\n2006\r\n• Acquired hydrographic data in support of the Office of Coast Survey; utilized GIS software and Python based\r\nautomations to process bathymetric data into NOAA nautical charts.\r\n• Served as Ancillary Data Manager; configured the Science Computing System(SCS), connected\/configured\r\nsensor to SCS servers, configured network ports for NMEA based sensors.\r\n• Applied coding skills to an array of shipboard problems; automated DVD library inventory tracking,\r\nimplemented GUI based Sea Service letter generator.\r\n• Spearheaded work flow initiatives implementing Smartsheet automations for travel system tracking,\r\npurchase request, ship's project instruction drafting and tracking.\r\nEXPERIENCE\r\nCommissioned Officer\r\nNOAA Commissioned Officer Corps\\\" "
 }